Tekla.Structures.Analysis.AnalysisObjectSelector
The AnalysisObjectSelector class contains methods for getting objects.

Tekla.Structures.Analysis.AnalysisObjectSelector.#ctor
This creates a new instance of the analysis object selector.

Tekla.Structures.Analysis.AnalysisObjectSelector.GetAnalysisModels
Returns an enumerator of all the analysis model objects.
Returns: A model object enumerator of all the analysis model objects.

Tekla.Structures.Analysis.AnalysisObjectSelector.GetSelectedObjects
Returns an enumerator of all the selected model objects in the current model.
NOT YET IMPLEMENTED.
Returns: A model object enumerator of all the selected model objects.

Tekla.Structures.Analysis.AnalysisObjectSelector.GetAllObjects(System.String)
Returns an enumerator of all the model objects in the current model.
NOT YET IMPLEMENTED.
AnalysisModelName: The name of the analysis model.
Returns: A model object enumerator of all the model objects.

Tekla.Structures.Analysis.AnalysisObjectSelector.GetAllObjectsWithType(Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.String)
Returns an enumerator of all the model objects in the current model with the given type.
ObjectToSelectType: The type of the objects to return.
AnalysisModelName: The name of the analysis model.
Returns: A model object enumerator of all the model objects with the given type.